CSI API ETABS v1
cStory.SetSimilarTo Method
 Sets the master story that a defined story should be similar to
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSimilarTo(
	string Name,
	string SimilarToStory
)
Function SetSimilarTo (
	Name As String,
	SimilarToStory As String
) As Integer
Dim instance As cStory
Dim Name As String
Dim SimilarToStory As String
Dim returnValue As Integer
returnValue = instance.SetSimilarTo(Name,
	SimilarToStory)
int SetSimilarTo(
	String^ Name,
	String^ SimilarToStory
)
abstract SetSimilarTo :
        Name : string *
        SimilarToStory : string -> int
Parameters
Name
Type: System.String
 The name of a defined story which is not a master story
SimilarToStory
Type: System.String
 The name of a defined master story that the requested story should be similar to
Return Value
Type: Int32
 Returns zero if the value is successfully set, otherwise returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim IsMasterStory As Boolean
       Dim SimilarToStory As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set story as master story
       ret = SapModel.Story.SetMasterStory("Story2", True)
   'set story similar to
       ret = SapModel.Story.SetSimilarTo("Story3", "Story2")
   'check
       ret = SapModel.Story.GetSimilarTo("Story3", IsMasterStory, SimilarToStory)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cStory Interface
ETABSv1 Namespace